Tools/src/Catalogs/ОИМЦ_63_Номенклатура/ОИМЦ_63_Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОИМЦ_63_Номенклатура</name>
  <owners>Catalog.ОИМЦ_63_Организации</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ОИМЦ_63_Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомИд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДругИд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Tools/src/Catalogs/ОИМЦ_63_Номенклатура/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Организация", Организация,,, ЗначениеЗаполнено(Организация));
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Организация) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	ТЗ = ОИМЦ_Данные.ЗапросДанных63("with cte_table as (select distinct ""nomID"", d2.description from ""movementDrug"".movement m" + 
									" left join documents.doc d2 on m.""nomID"" = d2.id where m.""orgID"" = " +
									Формат(ЭтотОбъект.Список.Отбор.Элементы[0].ПравоеЗначение.ОргИд, "ЧГ=0") + 
									") select * from cte_table order by description; ");
	Если ТЗ <> Неопределено Тогда
		УстановитьПривилегированныйРежим(Истина);
		Для каждого Элемент Из ТЗ Цикл
			ПредвНаименование = СокрЛП(Элемент.description);
			Если СтрДлина(ПредвНаименование) > 140 Тогда
				Наименование = Лев(ПредвНаименование, 140) + "_" + Формат(Элемент.nomID, "ЧГ=0");
			Иначе
				Наименование = СокрЛП(Элемент.description) + "_" + Формат(Элемент.nomID, "ЧГ=0");	
			КонецЕсли; 
			Поиск = Справочники.ОИМЦ_63_Номенклатура.НайтиПоНаименованию(Наименование, Истина, , ЭтотОбъект.Список.Отбор.Элементы[0].ПравоеЗначение.Ссылка);
			Если Поиск.Пустая() Тогда
				НО = Справочники.ОИМЦ_63_Номенклатура.СоздатьЭлемент();				
				НО.Наименование = Наименование; 
				НО.Владелец = ЭтотОбъект.Список.Отбор.Элементы[0].ПравоеЗначение.Ссылка;
				НО.Организация = ЭтотОбъект.Список.Отбор.Элементы[0].ПравоеЗначение.Ссылка;
				НО.НомИд = Элемент.nomID;			
				НО.Записать();	
			Иначе
				СО = Поиск.ПолучитьОбъект();							
				СО.НомИд = Элемент.nomID;			
				СО.Записать();	
			КонецЕсли; 			
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры
